Revit 2024 API
View.GenLevel Property
The level for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Level GenLevel { get; }
Visual Basic
Public ReadOnly Property GenLevel As Level
	Get
Visual C++
public:
property Level^ GenLevel {
	Level^ get ();
}
Remarks
This will obtain the level for views related to levels, such as Plan Views. If this View is not generated by a level, this property is null.
See Also
View Class
Autodesk.Revit.DB Namespace